wrk2/baseline/300KB/wrk-eth3-rep07.log
Running 30s test @ https://bench-eth2.netdev-lab.org/300k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 140.226ms, rate sampling interval: 378ms
  Thread calibration: mean lat.: 129.633ms, rate sampling interval: 373ms
  Thread calibration: mean lat.: 134.761ms, rate sampling interval: 371ms
  Thread calibration: mean lat.: 136.568ms, rate sampling interval: 381ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   130.80ms   52.29ms 348.67ms   71.53%
    Req/Sec    67.25      4.31    89.00     84.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  145.66ms
 75.000%  166.40ms
 90.000%  183.42ms
 99.000%  210.30ms
 99.900%  294.65ms
 99.990%  336.64ms
 99.999%  348.93ms
100.000%  348.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.557     0.000000            1         1.00
      35.839     0.100000          539         1.11
      93.695     0.200000         1077         1.25
     118.783     0.300000         1617         1.43
     136.447     0.400000         2155         1.67
     145.663     0.500000         2699         2.00
     149.631     0.550000         2965         2.22
     153.215     0.600000         3233         2.50
     157.439     0.650000         3499         2.86
     161.919     0.700000         3774         3.33
     166.399     0.750000         4042         4.00
     168.703     0.775000         4175         4.44
     171.263     0.800000         4305         5.00
     173.823     0.825000         4443         5.71
     176.511     0.850000         4578         6.67
     179.967     0.875000         4709         8.00
     181.631     0.887500         4777         8.89
     183.423     0.900000         4844        10.00
     185.471     0.912500         4912        11.43
     187.775     0.925000         4982        13.33
     190.207     0.937500         5047        16.00
     191.999     0.943750         5080        17.78
     193.663     0.950000         5112        20.00
     195.711     0.956250         5147        22.86
     197.375     0.962500         5181        26.67
     199.295     0.968750         5213        32.00
     200.575     0.971875         5230        35.56
     201.471     0.975000         5247        40.00
     202.751     0.978125         5266        45.71
     204.159     0.981250         5281        53.33
     205.567     0.984375         5297        64.00
     206.591     0.985938         5306        71.11
     208.511     0.987500         5314        80.00
     209.791     0.989062         5323        91.43
     210.687     0.990625         5331       106.67
     211.967     0.992188         5339       128.00
     213.887     0.992969         5344       142.22
     215.423     0.993750         5348       160.00
     217.087     0.994531         5352       182.86
     218.495     0.995313         5356       213.33
     221.439     0.996094         5360       256.00
     225.535     0.996484         5363       284.44
     233.983     0.996875         5365       320.00
     253.311     0.997266         5367       365.71
     260.735     0.997656         5369       426.67
     279.039     0.998047         5371       512.00
     287.231     0.998242         5372       568.89
     288.255     0.998437         5373       640.00
     289.535     0.998633         5374       731.43
     294.399     0.998828         5375       853.33
     294.655     0.999023         5376      1024.00
     316.159     0.999121         5377      1137.78
     316.159     0.999219         5377      1280.00
     318.463     0.999316         5378      1462.86
     318.463     0.999414         5378      1706.67
     319.743     0.999512         5379      2048.00
     319.743     0.999561         5379      2275.56
     319.743     0.999609         5379      2560.00
     336.639     0.999658         5380      2925.71
     336.639     0.999707         5380      3413.33
     336.639     0.999756         5380      4096.00
     336.639     0.999780         5380      4551.11
     336.639     0.999805         5380      5120.00
     348.927     0.999829         5381      5851.43
     348.927     1.000000         5381          inf
#[Mean    =      130.804, StdDeviation   =       52.285]
#[Max     =      348.672, Total count    =         5381]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8104 requests in 30.01s, 2.32GB read
Requests/sec:    270.00
Transfer/sec:     79.17MB