wrk2/baseline/300KB/wrk-wlan0-rep10.log
Running 30s test @ https://bench-eth2.netdev-lab.org/300k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 72.468ms, rate sampling interval: 263ms
  Thread calibration: mean lat.: 161.766ms, rate sampling interval: 783ms
  Thread calibration: mean lat.: 72.920ms, rate sampling interval: 267ms
  Thread calibration: mean lat.: 72.924ms, rate sampling interval: 249ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    63.82ms   55.91ms 948.22ms   94.16%
    Req/Sec    63.06     19.60   112.00     62.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   55.71ms
 75.000%   71.94ms
 90.000%   95.49ms
 99.000%  277.76ms
 99.900%  561.15ms
 99.990%  943.62ms
 99.999%  948.74ms
100.000%  948.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.487     0.000000            1         1.00
      20.655     0.100000          504         1.11
      31.487     0.200000         1008         1.25
      39.775     0.300000         1513         1.43
      47.999     0.400000         2016         1.67
      55.711     0.500000         2521         2.00
      58.847     0.550000         2771         2.22
      61.791     0.600000         3026         2.50
      65.279     0.650000         3276         2.86
      68.735     0.700000         3530         3.33
      71.935     0.750000         3781         4.00
      73.855     0.775000         3907         4.44
      76.671     0.800000         4031         5.00
      80.383     0.825000         4157         5.71
      84.415     0.850000         4286         6.67
      89.151     0.875000         4409         8.00
      91.647     0.887500         4472         8.89
      95.615     0.900000         4536        10.00
     100.607     0.912500         4598        11.43
     108.479     0.925000         4662        13.33
     115.327     0.937500         4725        16.00
     118.911     0.943750         4755        17.78
     124.991     0.950000         4787        20.00
     158.079     0.956250         4818        22.86
     244.991     0.962500         4851        26.67
     253.823     0.968750         4883        32.00
     258.431     0.971875         4898        35.56
     259.711     0.975000         4913        40.00
     263.167     0.978125         4930        45.71
     267.519     0.981250         4944        53.33
     270.847     0.984375         4960        64.00
     273.663     0.985938         4969        71.11
     274.431     0.987500         4976        80.00
     275.455     0.989062         4983        91.43
     278.015     0.990625         4991       106.67
     279.295     0.992188         4999       128.00
     280.575     0.992969         5003       142.22
     282.623     0.993750         5010       160.00
     283.135     0.994531         5011       182.86
     287.487     0.995313         5015       213.33
     289.791     0.996094         5019       256.00
     317.951     0.996484         5021       284.44
     392.447     0.996875         5024       320.00
     413.183     0.997266         5025       365.71
     523.519     0.997656         5027       426.67
     533.503     0.998047         5029       512.00
     534.527     0.998242         5030       568.89
     546.815     0.998437         5031       640.00
     558.079     0.998633         5032       731.43
     561.151     0.998828         5033       853.33
     562.687     0.999023         5034      1024.00
     562.687     0.999121         5034      1137.78
     571.903     0.999219         5035      1280.00
     571.903     0.999316         5035      1462.86
     576.511     0.999414         5036      1706.67
     576.511     0.999512         5036      2048.00
     576.511     0.999561         5036      2275.56
     943.615     0.999609         5037      2560.00
     943.615     0.999658         5037      2925.71
     943.615     0.999707         5037      3413.33
     943.615     0.999756         5037      4096.00
     943.615     0.999780         5037      4551.11
     948.735     0.999805         5038      5120.00
     948.735     1.000000         5038          inf
#[Mean    =       63.820, StdDeviation   =       55.915]
#[Max     =      948.224, Total count    =         5038]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7576 requests in 30.13s, 2.17GB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:    251.46
Transfer/sec:     73.77MB